src/cf/Catalogs/НастройкиМаршрутизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиМаршрутизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючМаршрутизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияRMQ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ИнтеграцияRMQ/Ext/Module.bsl
#Область ЧтениеСообщений

Процедура ЧтениеОбъектовRMQ() Экспорт
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	Если КлиентКомпоненты <> Неопределено Тогда
		Выборка = Справочники.НастройкиМаршрутизации.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, Выборка.Ссылка);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, НастройкаМаршрутизации)
	
	Попытка
		
		НастройкиПодключения = НастройкаМаршрутизации.НастройкиПодключения;
		
		КлиентКомпоненты.Connect(
			НастройкиПодключения.Адрес,
			НастройкиПодключения.Порт,
			НастройкиПодключения.Логин,
			НастройкиПодключения.Пароль,
			НастройкиПодключения.ВиртуальныйХост);
		
		КлючМаршрутизации = НастройкаМаршрутизации.КлючМаршрутизации;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(КлючМаршрутизации, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(КлючМаршрутизации, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Пока КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл
				ПолучитьОбъектИзJSON_ЗаписатьОбъект(ОтветноеСообщение);
				КлиентКомпоненты.BasicAck();
			КонецЦикла;
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		//СистемнаяОшибка = ОписаниеОшибки();
		//ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		//ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		//ВызватьИсключение ТекстСообщения;
	КонецПопытки;	
КонецПроцедуры

Процедура ПолучитьОбъектИзJSON_ЗаписатьОбъект(ОтветноеСообщение)
	
	Сериализатор = Новый СериализаторXDTO(ФабрикаXDTO);
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ОтветноеСообщение);
	Объект = Сериализатор.ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Объект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры	

#КонецОбласти

#Область РаботаСRabbit

Функция ПолучитьКомпонентуСервер()
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
	
КонецФункции

Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпоновкиНаСервере(Новый УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
			АдресВоВременномХранилище,
			"BITERP",
			ТипВнешнейКомпоненты.Native);
	//Сообщить(НСтр("ru = 'Компонента подключена!'"));
	
КонецПроцедуры

Функция ПолучитьАдресМакетаКомпоновкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = ПолучитьОбщийМакет("КомпонентаRMQ");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции


#КонецОбласти
